---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.SizingCalculationNoneWarn
source: html/61804b70-1319-71bb-b6ad-65bb1e61463c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ConnectorFailures.SizingCalculationNoneWarn Property

Some elements are not sized because the system calculation level is none or performance. You may change the system calculation level to size them again.

## Syntax (C#)
```csharp
public static FailureDefinitionId SizingCalculationNoneWarn { get; }
```